Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/dmac.h
#define DMAC_CHCTRLA_TRIGSRC_TC2_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC2_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC2 MC1 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC3_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC3_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC3 OVF Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC3_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC3_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC3 MC0 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC3_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC3_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC3 MC1 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC4_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC4_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC4 OVF Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC4_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC4_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC4 MC0 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC4_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC4_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC4 MC1 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC5_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC5_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC5 OVF Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC5_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC5_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC5 MC0 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC5_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC5_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC5 MC1 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC6_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC6_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC6 OVF Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC6_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC6_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC6 MC0 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC6_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC6_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC6 MC1 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC7_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC7_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC7 OVF Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC7_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC7_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC7 MC0 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC7_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC7_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC7 MC1 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC8_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC8_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC8 OVF Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC8_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC8_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC8 MC0 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC8_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC8_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC8 MC1 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC9_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC9_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC9 OVF Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC9_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC9_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC9 MC0 Position  */
#define DMAC_CHCTRLA_TRIGSRC_TC9_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC9_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC9 MC1 Position  */
#define DMAC_CHCTRLA_TRIGSRC_QSPI_DMAC_ID_RX  (DMAC_CHCTRLA_TRIGSRC_QSPI_DMAC_ID_RX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is QSPI RX Position  */
#define DMAC_CHCTRLA_TRIGSRC_QSPI_DMAC_ID_TX  (DMAC_CHCTRLA_TRIGSRC_QSPI_DMAC_ID_TX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is QSPI TX Position  */
#define DMAC_CHCTRLA_TRIGACT_Pos              _UINT32_(20)                                         /* (DMAC_CHCTRLA) Trigger Action Position */
#define DMAC_CHCTRLA_TRIGACT_Msk              (_UINT32_(0x3) << DMAC_CHCTRLA_TRIGACT_Pos)          /* (DMAC_CHCTRLA) Trigger Action Mask */
#define DMAC_CHCTRLA_TRIGACT(value)           (DMAC_CHCTRLA_TRIGACT_Msk & (_UINT32_(value) << DMAC_CHCTRLA_TRIGACT_Pos)) /* Assigment of value for TRIGACT in the DMAC_CHCTRLA register */
#define   DMAC_CHCTRLA_TRIGACT_BLOCK_Val      _UINT32_(0x0)                                        /* (DMAC_CHCTRLA) One trigger required for each block transfer  */
#define   DMAC_CHCTRLA_TRIGACT_BURST_Val      _UINT32_(0x2)                                        /* (DMAC_CHCTRLA) One trigger required for each burst transfer  */
#define   DMAC_CHCTRLA_TRIGACT_TRANSACTION_Val _UINT32_(0x3)                                        /* (DMAC_CHCTRLA) One trigger required for each transaction  */
#define DMAC_CHCTRLA_TRIGACT_BLOCK            (DMAC_CHCTRLA_TRIGACT_BLOCK_Val << DMAC_CHCTRLA_TRIGACT_Pos) /* (DMAC_CHCTRLA) One trigger required for each block transfer Position  */
#define DMAC_CHCTRLA_TRIGACT_BURST            (DMAC_CHCTRLA_TRIGACT_BURST_Val << DMAC_CHCTRLA_TRIGACT_Pos) /* (DMAC_CHCTRLA) One trigger required for each burst transfer Position  */
#define DMAC_CHCTRLA_TRIGACT_TRANSACTION      (DMAC_CHCTRLA_TRIGACT_TRANSACTION_Val << DMAC_CHCTRLA_TRIGACT_Pos) /* (DMAC_CHCTRLA) One trigger required for each transaction Position  */
#define DMAC_CHCTRLA_BURSTLEN_Pos             _UINT32_(24)                                         /* (DMAC_CHCTRLA) Burst Length Position */
#define DMAC_CHCTRLA_BURSTLEN_Msk             (_UINT32_(0xF) << DMAC_CHCTRLA_BURSTLEN_Pos)         /* (DMAC_CHCTRLA) Burst Length Mask */
#define DMAC_CHCTRLA_BURSTLEN(value)          (DMAC_CHCTRLA_BURSTLEN_Msk & (_UINT32_(value) << DMAC_CHCTRLA_BURSTLEN_Pos)) /* Assigment of value for BURSTLEN in the DMAC_CHCTRLA register */
#define   DMAC_CHCTRLA_BURSTLEN_SINGLE_Val    _UINT32_(0x0)                                        /* (DMAC_CHCTRLA) Single-beat burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_2BEAT_Val     _UINT32_(0x1)                                        /* (DMAC_CHCTRLA) 2-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_3BEAT_Val     _UINT32_(0x2)                                        /* (DMAC_CHCTRLA) 3-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_4BEAT_Val     _UINT32_(0x3)                                        /* (DMAC_CHCTRLA) 4-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_5BEAT_Val     _UINT32_(0x4)                                        /* (DMAC_CHCTRLA) 5-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_6BEAT_Val     _UINT32_(0x5)                                        /* (DMAC_CHCTRLA) 6-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_7BEAT_Val     _UINT32_(0x6)                                        /* (DMAC_CHCTRLA) 7-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_8BEAT_Val     _UINT32_(0x7)                                        /* (DMAC_CHCTRLA) 8-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_9BEAT_Val     _UINT32_(0x8)                                        /* (DMAC_CHCTRLA) 9-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_10BEAT_Val    _UINT32_(0x9)                                        /* (DMAC_CHCTRLA) 10-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_11BEAT_Val    _UINT32_(0xA)                                        /* (DMAC_CHCTRLA) 11-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_12BEAT_Val    _UINT32_(0xB)                                        /* (DMAC_CHCTRLA) 12-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_13BEAT_Val    _UINT32_(0xC)                                        /* (DMAC_CHCTRLA) 13-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_14BEAT_Val    _UINT32_(0xD)                                        /* (DMAC_CHCTRLA) 14-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_15BEAT_Val    _UINT32_(0xE)                                        /* (DMAC_CHCTRLA) 15-beats burst length  */
#define   DMAC_CHCTRLA_BURSTLEN_16BEAT_Val    _UINT32_(0xF)                                        /* (DMAC_CHCTRLA) 16-beats burst length  */
#define DMAC_CHCTRLA_BURSTLEN_SINGLE          (DMAC_CHCTRLA_BURSTLEN_SINGLE_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) Single-beat burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_2BEAT           (DMAC_CHCTRLA_BURSTLEN_2BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 2-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_3BEAT           (DMAC_CHCTRLA_BURSTLEN_3BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 3-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_4BEAT           (DMAC_CHCTRLA_BURSTLEN_4BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 4-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_5BEAT           (DMAC_CHCTRLA_BURSTLEN_5BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 5-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_6BEAT           (DMAC_CHCTRLA_BURSTLEN_6BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 6-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_7BEAT           (DMAC_CHCTRLA_BURSTLEN_7BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 7-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_8BEAT           (DMAC_CHCTRLA_BURSTLEN_8BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 8-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_9BEAT           (DMAC_CHCTRLA_BURSTLEN_9BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 9-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_10BEAT          (DMAC_CHCTRLA_BURSTLEN_10BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 10-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_11BEAT          (DMAC_CHCTRLA_BURSTLEN_11BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 11-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_12BEAT          (DMAC_CHCTRLA_BURSTLEN_12BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 12-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_13BEAT          (DMAC_CHCTRLA_BURSTLEN_13BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 13-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_14BEAT          (DMAC_CHCTRLA_BURSTLEN_14BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 14-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_15BEAT          (DMAC_CHCTRLA_BURSTLEN_15BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 15-beats burst length Position  */
#define DMAC_CHCTRLA_BURSTLEN_16BEAT          (DMAC_CHCTRLA_BURSTLEN_16BEAT_Val << DMAC_CHCTRLA_BURSTLEN_Pos) /* (DMAC_CHCTRLA) 16-beats burst length Position  */
#define DMAC_CHCTRLA_THRESHOLD_Pos            _UINT32_(28)                                         /* (DMAC_CHCTRLA) FIFO Threshold Position */
#define DMAC_CHCTRLA_THRESHOLD_Msk            (_UINT32_(0x3) << DMAC_CHCTRLA_THRESHOLD_Pos)        /* (DMAC_CHCTRLA) FIFO Threshold Mask */
#define DMAC_CHCTRLA_THRESHOLD(value)         (DMAC_CHCTRLA_THRESHOLD_Msk & (_UINT32_(value) << DMAC_CHCTRLA_THRESHOLD_Pos)) /* Assigment of value for THRESHOLD in the DMAC_CHCTRLA register */
#define   DMAC_CHCTRLA_THRESHOLD_1BEAT_Val    _UINT32_(0x0)                                        /* (DMAC_CHCTRLA) Destination write starts after each beat source address read  */
#define   DMAC_CHCTRLA_THRESHOLD_2BEATS_Val   _UINT32_(0x1)                                        /* (DMAC_CHCTRLA) Destination write starts after 2-beats source address read  */
#define   DMAC_CHCTRLA_THRESHOLD_4BEATS_Val   _UINT32_(0x2)                                        /* (DMAC_CHCTRLA) Destination write starts after 4-beats source address read  */
#define   DMAC_CHCTRLA_THRESHOLD_8BEATS_Val   _UINT32_(0x3)                                        /* (DMAC_CHCTRLA) Destination write starts after 8-beats source address read  */
#define DMAC_CHCTRLA_THRESHOLD_1BEAT          (DMAC_CHCTRLA_THRESHOLD_1BEAT_Val << DMAC_CHCTRLA_THRESHOLD_Pos) /* (DMAC_CHCTRLA) Destination write starts after each beat source address read Position  */
#define DMAC_CHCTRLA_THRESHOLD_2BEATS         (DMAC_CHCTRLA_THRESHOLD_2BEATS_Val << DMAC_CHCTRLA_THRESHOLD_Pos) /* (DMAC_CHCTRLA) Destination write starts after 2-beats source address read Position  */
#define DMAC_CHCTRLA_THRESHOLD_4BEATS         (DMAC_CHCTRLA_THRESHOLD_4BEATS_Val << DMAC_CHCTRLA_THRESHOLD_Pos) /* (DMAC_CHCTRLA) Destination write starts after 4-beats source address read Position  */
#define DMAC_CHCTRLA_THRESHOLD_8BEATS         (DMAC_CHCTRLA_THRESHOLD_8BEATS_Val << DMAC_CHCTRLA_THRESHOLD_Pos) /* (DMAC_CHCTRLA) Destination write starts after 8-beats source address read Position  */
#define DMAC_CHCTRLA_Msk                      _UINT32_(0x3F30FF43)                                 /* (DMAC_CHCTRLA) Register Mask  */


/* -------- DMAC_CHCTRLB : (DMAC Offset: 0x04) (R/W 8) Channel n Control B -------- */
#define DMAC_CHCTRLB_RESETVALUE               _UINT8_(0x00)                                        /*  (DMAC_CHCTRLB) Channel n Control B  Reset Value */

#define DMAC_CHCTRLB_CMD_Pos                  _UINT8_(0)                                           /* (DMAC_CHCTRLB) Software Command Position */
#define DMAC_CHCTRLB_CMD_Msk                  (_UINT8_(0x3) << DMAC_CHCTRLB_CMD_Pos)               /* (DMAC_CHCTRLB) Software Command Mask */
#define DMAC_CHCTRLB_CMD(value)               (DMAC_CHCTRLB_CMD_Msk & (_UINT8_(value) << DMAC_CHCTRLB_CMD_Pos)) /* Assigment of value for CMD in the DMAC_CHCTRLB register */
#define   DMAC_CHCTRLB_CMD_NOACT_Val          _UINT8_(0x0)                                         /* (DMAC_CHCTRLB) No action  */
#define   DMAC_CHCTRLB_CMD_SUSPEND_Val        _UINT8_(0x1)                                         /* (DMAC_CHCTRLB) Channel suspend operation  */
#define   DMAC_CHCTRLB_CMD_RESUME_Val         _UINT8_(0x2)                                         /* (DMAC_CHCTRLB) Channel resume operation  */
#define DMAC_CHCTRLB_CMD_NOACT                (DMAC_CHCTRLB_CMD_NOACT_Val << DMAC_CHCTRLB_CMD_Pos) /* (DMAC_CHCTRLB) No action Position  */
#define DMAC_CHCTRLB_CMD_SUSPEND              (DMAC_CHCTRLB_CMD_SUSPEND_Val << DMAC_CHCTRLB_CMD_Pos) /* (DMAC_CHCTRLB) Channel suspend operation Position  */
#define DMAC_CHCTRLB_CMD_RESUME               (DMAC_CHCTRLB_CMD_RESUME_Val << DMAC_CHCTRLB_CMD_Pos) /* (DMAC_CHCTRLB) Channel resume operation Position  */
#define DMAC_CHCTRLB_Msk                      _UINT8_(0x03)                                        /* (DMAC_CHCTRLB) Register Mask  */


